app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Politics"]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 3]]
---
  def index
    if params[:category].blank?
    @articles = Article.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @articles = Article.where(category_id: @category_id).order("created_at DESC")

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "テスト記事"], ["content", "Wikipediaっぽくやる。\r\n"], ["created_at", "2016-05-10 20:01:36.131284"], ["updated_at", "2016-05-10 20:01:36.131284"]]
---
  def create
    @article = current_user.articles.build(article_params)
    if @article.save

UPDATE "articles" SET "category_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["category_id", 2], ["updated_at", "2016-05-22 13:25:11.379732"], ["id", 5]]
---
  def update
    if @article.update(article_params)